app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)  [["name", "John Alex"], ["email", "johnalex@email.com"], ["created_at", "2022-05-06 04:09:16.169483"], ["updated_at", "2022-05-06 04:09:16.169483"], ["password_digest", "[FILTERED]"]]
---
  def create
    @user = User.new(user_params)
    return if @user.save